JeanOlivotto/robot_assistant/firmware/sdkconfig.defaults
# Comum a todos os chips. Específico do chip vai em sdkconfig.defaults.<target>.
CONFIG_IDF_TARGET="esp32c3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# OTA pelo Wi-Fi: a imagem recém-instalada sobe em teste e só é confirmada quando o robô
# consegue falar com o servidor (core/ota.c). Se não conseguir, o bootloader volta para a anterior.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# TLS com buffers sob demanda: o de 16 KB de entrada só existe enquanto chega dado, e o
# certificado da CA sai da memória depois do handshake. Sem PSRAM, é o que deixa o Bluetooth caber.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
